// Напишите программу, которая принимает на вход пятизначное число
// и проверяет является ли оно палиндромом

// Можно попробовать решить через string или массив

Console.Clear();

System.Console.WriteLine("Введите пятизначное число --> ");

